app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.new(sc_params(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Software Engineering"], ["room_number", "10"]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(sc_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", "10"], ["id", 1]]